Revit 2024 API
BuiltInFailures.DimensionFailures.WrongConstraintInSkeletonSketch Property
 Reference Lines can only be constrained to Reference Planes, Levels, Family Host, and other Reference Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WrongConstraintInSkeletonSketch { get; }
Visual Basic
Public Shared ReadOnly Property WrongConstraintInSkeletonSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WrongConstraintInSkeletonSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace